'use strict';

// =============================================================================
// Задание 9
// =============================================================================
/**
 * Создайте животного, млекопитающегося и собаки (наследование)
 * Напишите конструкторы Animal, Mammal и Dog
 * которые наследуются друг от друга.
 * Создайте свойства и методы для классов:
 *  Animal - limbs (конечности шт.) - number
 *  Mammal - isMammal (является млекопитающим) - boolean
 *  Dog - bark() (гав-гав) - function
 */
console.log(dog.limbs); // 4
console.log(dog.isMammal); // true
dog.bark(); // гав-гав
